Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྟོང་པ་ཉིད་ལ་འདས་པའི་གཟུགས་དམིགས་པར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས།
en: So how could past physical forms be apprehended in emptiness?

source: སྟོང་པ་ཉིད་ལ་འདས་པའི་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་སྟོང་པ་ཉིད་ལ་འདས་པའི་རྣམ་པར་ཤེས་པ་དམིགས་སུ་མེད་དེ།
en: In emptiness, past feelings, perceptions, formative predispositions, and consciousness are nonapprehensible.

source: སྟོང་པ་ཉིད་ལ་འདས་པའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དམིགས་པར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས།
en: So, how could past feelings, perceptions, formative predispositions, and consciousness be apprehended in emptiness?

source: སྟོང་པ་ཉིད་ལ་མ་འོངས་པའི་གཟུགས་དམིགས་སུ་མེད་དེ།
en: In emptiness, future physical forms are nonapprehensible.

source: སྟོང་པ་ཉིད་ལ་མ་འོངས་པའི་གཟུགས་དམིགས་པར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས།
en: So, how could future physical forms be apprehended in emptiness?

source: སྟོང་པ་ཉིད་ལ་མ་འོངས་པའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་སྟོང་པ་ཉིད་ལ་མ་འོངས་པའི་རྣམ་པར་ཤེས་པ་དམིགས་སུ་མེད་དེ།
en: In emptiness, future feelings, perceptions, and formative predispositions are nonapprehensible, and in emptiness, future consciousness is nonapprehensible.

source: སྟོང་པ་ཉིད་ལ་མ་འོངས་པའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དམིགས་པར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས།
en: So, how could future feelings, perceptions, formative predispositions, and consciousness be apprehended in emptiness?

source: སྟོང་པ་ཉིད་ལ་ད་ལྟར་བྱུང་བའི་གཟུགས་དམིགས་སུ་མེད་དོ།
en: In emptiness, present physical forms are nonapprehensible.

source: །སྟོང་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་པས་དམིགས་སུ་མེད་ན།
en: Emptiness, too, is nonapprehensible because it is empty of emptiness.

source: སྟོང་པ་ཉིད་ལ་ད་ལྟར་བྱུང་བའི་གཟུགས་དམིགས་པར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས།
en: So, how could present physical forms be apprehended in emptiness?

source: སྟོང་པ་ཉིད་ལ་ད་ལྟར་བྱུང་བའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དམིགས་སུ་མེད་དོ།
en: In emptiness, present feelings, perceptions, formative predispositions, and consciousness are nonapprehensible.

source: སྟོང་པ་ཉིད་ལ་ད་ལྟར་བྱུང་བའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དམིགས་པར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས།
en: So, how could present feelings, perceptions, formative predispositions, and consciousness be apprehended in emptiness? {

source: རབ་འབྱོར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Dt.241} “Subhūti, the perfection of generosity does not apprehend the limit of the past.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: The perfection of generosity does not apprehend the limit of the future.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: The perfection of generosity does not apprehend the present.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: The perfection of generosity does not apprehend the sameness of the three times.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མཉམ་པ་ཉིད་ལ་འདས་པའི་དུས་མི་དམིགས།
en: If you ask why, Subhūti, in sameness, the past is nonapprehensible.

source: མཉམ་པ་ཉིད་ལ་མ་འོངས་པའི་དུས་མི་དམིགས།
en: In sameness, the future is nonapprehensible.

source: མཉམ་པ་ཉིད་ལ་ད་ལྟར་བྱུང་བའི་དུས་མི་དམིགས་ཏེ།
en: In sameness, the present is nonapprehensible.

source: མཉམ་པ་ཉིད་ཀྱང་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ན།
en: In sameness, even sameness is nonapprehensible.

source: མཉམ་པ་ཉིད་ལ་འདས་པའི་དུས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས། མ་འོངས་པའི་དུས་དང་། ད་ལྟར་བྱུང་བའི་དུས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས།
en: So, how could the past be apprehended in sameness, and how could the future and the present be apprehended? “

source: རབ་འབྱོར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Subhūti, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom do not apprehend the limit of the past.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: The perfection of wisdom [and so forth] do not apprehend the limit of the future.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: The perfection of wisdom [and so forth] do not apprehend the present.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: The perfection of wisdom [and so forth] do not apprehend the sameness of the three times.

source: མཉམ་པ་ཉིད་ལ་འདས་པའི་དུས་དམིགས། པ་ལྟ་ཅི་ཞིག་སྨོས། མ་འོངས་པའི་དུས་དང་། ད་ལྟར་བྱུང་བའི་དུས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས།
en: So, how could the past be apprehended in sameness, and how could the future and the present be apprehended? “

source: རབ་འབྱོར་ནང་སྟོང་པ་ཉིད་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Subhūti, the emptiness of internal phenomena does not apprehend the limit of the past.

source: ནང་སྟོང་པ་ཉིད་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: The emptiness of internal phenomena does not apprehend the limit of the future.

source: ནང་སྟོང་པ་ཉིད་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: The emptiness of internal phenomena does not apprehend the present.

source: ནང་སྟོང་པ་ཉིད་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: The emptiness of internal phenomena does not apprehend the sameness of the three times.

source: རབ་འབྱོར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Subhūti, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, do not apprehend the limit of the past.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: The emptiness of the essential nature of nonentities [and so forth] do not apprehend the limit of the future.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: The emptiness of the essential nature of nonentities [and so forth] do not apprehend the present.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: The emptiness of the essential nature of nonentities [and so forth] do not apprehend the sameness of the three times.

source: རབ་འབྱོར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Subhūti, the applications of mindfulness do not apprehend the limit of the past.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: The applications of mindfulness do not apprehend the limit of the future.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: The applications of mindfulness do not apprehend the present.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: The applications of mindfulness do not apprehend the sameness of the three times.

source: མཉམ་པ་ཉིད་ལ་འདས་པའི་དུས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས། མ་འོངས་པའི་དུས་དང་། ད་ལྟར་བྱུང་བའི་དུས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས། རབ་འབྱོར་ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: So, how could the past be apprehended in sameness, and how could the future and the present be apprehended? {

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Dt.242} “Subhūti, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path do not apprehend the limit of the past.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: The noble eightfold path [and so forth] do not apprehend the limit of the future.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: The noble eightfold path [and so forth] do not apprehend the present.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: The noble eightfold path [and so forth] do not apprehend the sameness of the three times.

source: མཉམ་པ་ཉིད་ལ་འདས་པའི་དུས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས། མ་འོངས་པའི་དུས་དང་། ད་ལྟར་བྱུང་བའི་དུས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས། རབ་འབྱོར་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: So, how could the past be apprehended in sameness, and how could the future and the present be apprehended? “

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: Subhūti, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas do not apprehend the limit of the past.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: The eighteen distinct qualities of the buddhas [and so forth] do not apprehend the limit of the future.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: The eighteen distinct qualities of the buddhas [and so forth] do not apprehend the present.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: The eighteen distinct qualities of the buddhas [and so forth] do not apprehend the sameness of the three times.

source: རབ་འབྱོར་གཞན་ཡང་སོ་སོའི་སྐྱེ་བོ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Moreover, Subhūti, ordinary people do not apprehend the limit of the past.

source: སོ་སོའི་སྐྱེ་བོ་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: Ordinary people do not apprehend the limit of the future.

source: སོ་སོའི་སྐྱེ་བོ་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: Ordinary people do not apprehend the present.

source: སོ་སོའི་སྐྱེ་བོ་ནི། དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: Ordinary people do not apprehend the sameness of the three times.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: If you ask why, it is owing to the nonapprehensibility of beings.

source: །རབ་འབྱོར་གཞན་ཡང་ཉན་ཐོས་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: In addition, Subhūti, śrāvakas do not apprehend the limit of the past.

source: ཉན་ཐོས་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: Śrāvakas do not apprehend the limit of the future.

source: ཉན་ཐོས་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: Śrāvakas do not apprehend the present.

source: ཉན་ཐོས་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: Śrāvakas do not apprehend the sameness of the three times.

source: །རབ་འབྱོར་གཞན་ཡང་རང་སངས་རྒྱས་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Furthermore, Subhūti, pratyekabuddhas do not apprehend the limit of the past.

source: རང་སངས་རྒྱས་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: Pratyekabuddhas do not apprehend the limit of the future.

source: རང་སངས་རྒྱས་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: Pratyekabuddhas do not apprehend the present.

source: རང་སངས་རྒྱས་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: Pratyekabuddhas do not apprehend the sameness of the three times.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Again, Subhūti, bodhisattvas do not apprehend the limit of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: Bodhisattvas do not apprehend the limit of the future.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: Bodhisattvas do not apprehend the present.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: Bodhisattvas do not apprehend the sameness of the three times.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།། །།
en: If you ask why, it is owing to the nonapprehensibility of beings. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་ཉི་ཤུ་གཉིས་པ། རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས།
en: Moreover, Subhūti, tathāgatas do not apprehend the limit of the past.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཕྱི་མའི་མཐར་མི་དམིགས།
en: Tathāgatas do not apprehend the limit of the future.

source: དེ་བཞིན་གཤེགས་པ་ནི་ད་ལྟར་བྱུང་བར་མི་དམིགས།
en: Tathāgatas do not apprehend the present.

source: དེ་བཞིན་གཤེགས་པ་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་མི་དམིགས་ཏེ།
en: Tathāgatas do not apprehend the sameness of the three times.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། དུས་གསུམ་མཉམ་པ་ཉིད་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ།
en: So it is, Subhūti, that bodhisattva great beings who maintain the perfection of wisdom, having trained in the sameness of the three times, should perfect all-aspect omniscience.

source: རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་དུས་གསུམ་མཉམ་པ་ཉིད་ཅེས་བྱ་བ་སྟེ།
en: Subhūti, this is the Great Vehicle of bodhisattva great beings, designated as the sameness of the three times.

source: དེ་ལ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་ངོ་།
en: Abiding in it, bodhisattva great beings overpower the world with its gods, humans, and asuras, and they attain emancipation in all-aspect omniscience.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the venerable Subhūti said to the Blessed One, “Blessed Lord!

source: །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་དུས་གསུམ་མཉམ་པ་ཉིད་ཅེས་བགྱི་བ་འདི་ལེགས་པར་གསུངས་པ་ནི་ལེགས་ཤིང་དགེ་བ་སྟེ།
en: Well indeed has the Lord taught the Great Vehicle of bodhisattva great beings, which is designated as the sameness of the three times! Blessed Lord!

source: བཅོམ་ལྡན་འདས་ཐེག་པ་ཆེན་པོ་འདི་ལ་བསླབས་ཤིང་། འདས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཀྱང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་བོ།
en: Bodhisattva great beings of the past, who have trained in this Great Vehicle, have acquired all-aspect omniscience.

source: །བཅོམ་ལྡན་འདས་མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Blessed Lord! Bodhisattva great beings of the future, also, having trained in this perfection of wisdom, will acquire all-aspect omniscience. Blessed Lord!

source: །བཅོམ་ལྡན་འདས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་དང་གྲངས་མ་མཆིས་པ་དག་ན། དཔག་ཏུ་མ་མཆིས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆིས་པ་རྣམས་ཀྱང་། ཐེག་པ་ཆེན་པོ་འདི་ཉིད་ལ་བསླབས་ཤིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Bodhisattva great beings of the present, who are inestimable in number, [residing] in the countless and limitless world systems of the ten directions, having trained in this Great Vehicle, are currently acquiring all-aspect omniscience.

source: །བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་དུས་གསུམ་མཉམ་པ་ཉིད་ཅེས་བགྱི་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོའོ།
en: Blessed Lord! That is why this, designated as the sameness of the three times, is the Great Vehicle of bodhisattva great beings.”

source: །དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་དེ་དེ་བཞིན་ནོ།
en: The Blessed One then replied to the venerable Subhūti, “Subhūti, that is so!

source: ཐེག་པ་ཆེན་པོ་འདི་ཉིད་ལ་བསླབས་ཤིང་། འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་པར་གྱུར་ཏོ། །བརྙེས་སོ། །བརྙེས་པར་འགྱུར་རོ།
en: Having trained in this Great Vehicle, the tathāgatas, arhats, completely awakened buddhas of the past, future, and present have acquired, will acquire, and are acquiring all-aspect omniscience.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་བཅུ་གཅིག་པའོ།། །།
en: This completes the eleventh chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་གང་གི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གནས་བརྟན་རབ་འབྱོར་འདི་ནི།
en: Chapter 12 Then the venerable Pūrṇa Maitrāyaṇīputra said to the Blessed One, “Blessed Lord! {

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སླད་དུ་བསྐོ་བ་མཛད་པས། འདི་ནི་ཐེག་པ་ཆེན་པོ་བསྟན་པ་ཙམ་དུ་སེམས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: Dt.243} This elder Subhūti, who has been asked about the perfection of wisdom by the Tathāgata, Arhat, completely awakened Buddha, thinks of it just as teaching the Great Vehicle.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་འགལ་བར་ཐེག་པ་ཆེན་པོ་བསྟན་པར་མ་གྱུར་ལགས་གྲང་།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, I hope that I have not contradicted the perfection of wisdom while teaching the Great Vehicle?” “Subhūti, you have not done so!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: replied the Blessed One. “

source: རབ་འབྱོར་དེ་ལྟར་གྱུར་པ་མེད་དེ། རབ་འབྱོར་ཁྱོད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་རྗེས་སུ་འཐུན་པར་ཐེག་པ་ཆེན་པོ་སྟོན་ཏོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Subhūti, you do teach the Great Vehicle in conformity with the perfection of wisdom.

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་དགེ་བའི་ཆོས་གང་ཡང་རུང་སྟེ། ཉན་ཐོས་ཀྱི་ཆོས་སམ། རང་སངས་རྒྱས་ཀྱི་ཆོས་སམ། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སམ། སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ནང་དུ་འདུས་ཤིང་ཁོངས་སུ་ཆུད་དོ།
en: If you ask why, Subhūti, it is because whatever virtuous attributes there are, be they the attributes of śrāvakas, the attributes of pratyekabuddhas, the attributes of bodhisattvas, or the attributes of buddhas, all of them are indeed gathered and included within the perfection of wisdom.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དགེ་བའི་ཆོས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ནང་དུ་འདུས་ཤིང་ཁོངས་སུ་ཆུད་པ་དེ་ལྟ་བུའི་ཉན་ཐོས་ཀྱི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་
en: Subhūti then asked, “Blessed Lord, what are the virtuous attributes, the factors conducive to enlightenment, that are gathered and included within the perfection of wisdom?

source: ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། མི་མཉམ་པའི་ཆོས་ཉིད་དང་། རྟག་ཏུ་བཏང་སྙོམས་ཀྱི་རྣམ་པར་སྤྱོད་པ་སྟེ། རབ་འབྱོར་དེ་དག་ནི་དགེ་བའི་ཆོས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ནང་དུ་འདུ་ཞིང་ཁོངས་སུ་ཆུད་པར་འདོད་པ་སྟེ། ཉན་ཐོས་ཀྱི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདི་ལྟར་ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། གཟུགས་གང་ཡིན་པ་དང་། ཚོར་བ་གང་ཡིན་པ་དང་། འདུ་ཤེས་གང་ཡིན་པ་དང་། འདུ་བྱེད་གང་ཡིན་པ་དང་། རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། མིག་གང་ཡིན་པ་དང་། གཟུགས་གང་ཡིན་པ་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་གང་ཡིན་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་གང་ཡིན་པ་དང་། རྣ་བ་གང་ཡིན་པ་དང་། སྒྲ་གང་ཡིན་པ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་གང་ཡིན་པ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་གང་ཡིན་པ་དང་། སྣ་གང་ཡིན་པ་དང་། དྲི་གང་ཡིན་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་གང་ཡིན་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་གང་ཡིན་པ་དང་། ལྕེ་གང་ཡིན་པ་དང་། རོ་གང་ཡིན་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་གང་ཡིན་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་གང་ཡིན་པ་དང་། ལུས་གང་ཡིན་པ་དང་། རེག་གང་ཡིན་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་གང་ཡིན་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་གང་ཡིན་པ་དང་། ཡིད་གང་ཡིན་པ་དང་། ཆོས་གང་ཡིན་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་གང་ཡིན་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་གང་ཡིན་པ་དང་། མ་རིག་པ་གང་ཡིན་པ་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་། མིང་དང་
en: What are those attributes of the śrāvakas, those attributes of the pratyekabuddhas, those attributes of the bodhisattvas, and those attributes of the buddhas?”

source: གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་གང་ཡིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ནང་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་། ཕྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་གང་ཡིན་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་གང་ཡིན་པ་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་གང་ཡིན་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་གང་ཡིན་པ་དང་། དབང་པོ་རྣམས་གང་ཡིན་པ་དང་། སྟོབས་རྣམས་གང་ཡིན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་གང་ཡིན་པ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་གང་ཡིན་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་གང་ཡིན་པ་དང་། བསམ་གཏན་རྣམས་གང་ཡིན་པ་དང་། ཚད་མེད་པ་རྣམས་གང་ཡིན་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་གང་ཡིན་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་གང་ཡིན་པ་དང་། ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་གང་ཡིན་པ་དང་། རྒྱས་པའི་སྐྱེ་མཆེད་བཅུ་གང་ཡིན་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་གང་ཡིན་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་གང་ཡིན་པ་དང་། སྡུག་བསྔལ་གང་ཡིན་པ་དང་། ཀུན་འབྱུང་བ་གང་ཡིན་པ་དང་། འགོག་པ་གང་ཡིན་པ་དང་། ལམ་གང་ཡིན་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་གང་ཡིན་པ་དང་། ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དང་། གཟུངས་ཀྱི་སྒོ་གང་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་གང་ཡིན་པ་དང་། མི་འཇིགས་པ་བཞི་གང་ཡིན་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་གང་ཡིན་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་གང་ཡིན་པ་དང་།
en: The Blessed One replied, “They comprise the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the gateways to liberation—emptiness, signlessness, and wishlessness—the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the six extrasensory powers, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of internal and external phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, great empathetic joy, great equanimity, the eighteen distinct qualities of the buddhas, unimpaired reality, and perpetual equanimity. “
